Revit 2018 API
Rebar.BarsOnNormalSide Property
 Identifies if the bars of the rebar set are on the same side of the rebar plane indicated by the normal.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Since: 2009
Syntax
C#
[ObsoleteAttribute("This property is deprecated in Revit 2018 and will be removed in the next version of Revit. We suggest you use the GetShapeDrivenAccessor().BarsOnNormalSide property instead.")]
public bool BarsOnNormalSide { get; set; }
Visual Basic
<ObsoleteAttribute("This property is deprecated in Revit 2018 and will be removed in the next version of Revit. We suggest you use the GetShapeDrivenAccessor().BarsOnNormalSide property instead.")> _
Public Property BarsOnNormalSide As Boolean
	Get
	Set
Visual C++
[ObsoleteAttribute(L"This property is deprecated in Revit 2018 and will be removed in the next version of Revit. We suggest you use the GetShapeDrivenAccessor().BarsOnNormalSide property instead.")]
public:
property bool BarsOnNormalSide {
	bool get ();
	void set (bool value);
}
Field Value
 True if the bars of rebar set are on the same side of the rebar plane indicated by the normal, and false if the bars are on the opposite side.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.DisabledDisciplineException |  When setting this property: None of the following disciplines is enabled: Structural.
Autodesk.Revit.Exceptions.InapplicableDataException |  This rebar element represents a single bar (the layout rule is Single).
Autodesk.Revit.Exceptions.InvalidOperationException |  This method applies only to shape driven rebar.
See Also
Rebar Class
Autodesk.Revit.DB.Structure Namespace